'''
리스트 (배열)
# 56) 리스트 자르기
# 57) 첫 번째로 나오는 음수
# 58) 배열 만들기 3
# 59) 2의 영역
# 60) 배열 조각하기
'''

# 56) ===========================================================================
def cut_list(n, slicer, num_list):
    a, b, c = slicer
    if n == 1: return num_list[:b+1]
    elif n == 2: return num_list[a:]
    elif n == 3: return num_list[a:b+1]
    elif n == 4: return num_list[a:b+1:c]
    return num_list

'''
return [num_list[:b + 1], num_list[a:], num_list[a:b + 1], num_list[a:b + 1:c]][n - 1]

slices = {
    1: num_list[:b+1],
    2: num_list[a:],
    3: num_list[a:b+1],
    4: num_list[a:b+1:c]
}
return slices.get(n, num_list)
'''

# [2, 3, 4, 5, 6]
print(cut_list(3, [1, 5, 2], [1, 2, 3, 4, 5, 6, 7, 8, 9]))


# 57) ===========================================================================


print()


# 58) ===========================================================================


print()


# 59) ===========================================================================


print()


# 60) ===========================================================================


print()

