'''
부모와 자식 사이를 1촌으로 정의하고 이로부터 사람들 간의 촌수를 계산한다.
예를 들면 나와 아버지, 아버지와 할아버지는 각각 1촌으로
나와 할아버지는 2촌이 되고,
아버지 형제들과 할아버지는 1촌,
나와 아버지 형제들과는 3촌이 된다.
여러 사람들에 대한 부모 자식들 간의 관계가 주어졌을 때, 주어진 두 사람의 촌수를 계산하는 프로그램을 작성하시오.

사람들은 1, 2, 3, …, n (1 ≤ n ≤ 100)의 연속된 번호로 각각 표시된다.
입력 파일의 첫째 줄에는 전체 사람의 수 n이 주어지고,
둘째 줄에는 촌수를 계산해야 하는 서로 다른 두 사람의 번호가 주어진다.
그리고 셋째 줄에는 부모 자식들 간의 관계의 개수 m이 주어진다.
넷째 줄부터는 부모 자식간의 관계를 나타내는 두 번호 x,y가 각 줄에 나온다.
이때 앞에 나오는 번호 x는 뒤에 나오는 정수 y의 부모 번호를 나타낸다.
각 사람의 부모는 최대 한 명만 주어진다.

입력에서 요구한 두 사람의 촌수를 나타내는 정수를 출력한다.
어떤 경우에는 두 사람의 친척 관계가 전혀 없어 촌수를 계산할 수 없을 때가 있다. 이때에는 -1을 출력해야 한다.
'''

import sys
from collections import deque

input = lambda: sys.stdin.readline().strip()

sys.stdin = open("input.txt", "r")

N = int(input())                    # 전체 사람 수
S, E = map(int, input().split())    # 촌수 계산 필요한 가족 구성원 2 (시작점-끝점)
M = int(input())                    # 총 관계 수

adj = [[] for _ in range(N + 1)]    # 부모 자식 쌍
for _ in range(M):
    x, y = map(int, input().split())
    # 부모자식 순이어도 어쨌거나 연결되어 있으니까 양방향 연결을 해야함!
    adj[x].append(y)
    adj[y].append(x)

# 한 번에 한 칸 씩 건너가서 최단거리 계산
def BFS(s, e):
    # 초기화 및 방문처리
    queue = deque([s])
    v = [0] * (N + 1)
    v[s] = 1

    while queue:
        c = queue.popleft()

        # 목적지에 도착하면 방문처리 뺀 촌수만 리턴
        if c == e:
            return v[e] - 1

        # c와 연결된 모든 노드 탐방
        for n in adj[c]:
            # 방문하지 않았다면 방문하기 (not v[e])
            if v[n] == 0:
                queue.append(n)
                # 방문처리 겸 촌수 계산
                v[n] = v[c] + 1

    return -1   # 연결된 가족이 없을 경우 -1 리턴

print(BFS(S, E))





'''
9
7 3
7
1 2
1 3
2 7
2 8
2 9
4 5
4 6

# 3

9
8 6
7
1 2
1 3
2 7
2 8
2 9
4 5
4 6

# -1
'''